apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_pwm.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/timers/pwm.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32l4_pwm.h"
#include "stm32.h"

/* This module then only compiles if there is at least one enabled timer
 * intended for use with the PWM upper half driver.
 */

#if defined(CONFIG_STM32_TIM1_PWM)  || defined(CONFIG_STM32_TIM2_PWM)   || \
    defined(CONFIG_STM32_TIM3_PWM)  || defined(CONFIG_STM32_TIM4_PWM)   || \
    defined(CONFIG_STM32_TIM5_PWM)  || defined(CONFIG_STM32_TIM8_PWM)   || \
    defined(CONFIG_STM32_TIM15_PWM) || defined(CONFIG_STM32_TIM16_PWM)  || \
    defined(CONFIG_STM32_TIM17_PWM) || defined(CONFIG_STM32_LPTIM1_PWM) || \
    defined(CONFIG_STM32_LPTIM2_PWM)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PWM/Timer Definitions ****************************************************/

/* The following definitions are used to identify the various time types */

#define TIMTYPE_BASIC        0  /* Basic timers: TIM6,7 */
#define TIMTYPE_GENERAL16    1  /* General 16-bit timers: TIM3,4 */
#define TIMTYPE_COUNTUP16    2  /* General 16-bit count-up timers: TIM15-17 */
#define TIMTYPE_COUNTUP16_N  3  /* General 16-bit count-up timers with
                                 * complementary outputs
                                 */
#define TIMTYPE_GENERAL32    4  /* General 32-bit timers: TIM2,5 */
#define TIMTYPE_ADVANCED     5  /* Advanced timers:  TIM1,8 */
#define TIMTYPE_LOWPOWER     6  /* Low Power timers: LPTIM1,2 */

#define TIMTYPE_TIM1       TIMTYPE_ADVANCED
#define TIMTYPE_TIM2       TIMTYPE_GENERAL32
#define TIMTYPE_TIM3       TIMTYPE_GENERAL16
#define TIMTYPE_TIM4       TIMTYPE_GENERAL16
#define TIMTYPE_TIM5       TIMTYPE_GENERAL32
#define TIMTYPE_TIM6       TIMTYPE_BASIC
#define TIMTYPE_TIM7       TIMTYPE_BASIC
#define TIMTYPE_TIM8       TIMTYPE_ADVANCED
#define TIMTYPE_TIM15      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM16      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_TIM17      TIMTYPE_COUNTUP16_N /* Treated as ADVTIM */
#define TIMTYPE_LPTIM1     TIMTYPE_LOWPOWER
#define TIMTYPE_LPTIM2     TIMTYPE_LOWPOWER

/* Advanced Timer support
 * NOTE: TIM15-17 are not ADVTIM but they support most of the
 *       ADVTIM functionality.  The main difference is the number of
 *       supported capture/compare.
 */

#if defined(CONFIG_STM32_TIM1_PWM) || defined(CONFIG_STM32_TIM8_PWM) || \
    defined(CONFIG_STM32_TIM15_PWM) || defined(CONFIG_STM32_TIM16_PWM) || \
    defined(CONFIG_STM32_TIM17_PWM)
#  define HAVE_ADVTIM
#else
#  undef HAVE_ADVTIM
#endif

/* Low power Timer support */

#if defined(CONFIG_STM32_LPTIM1_PWM) || defined(CONFIG_STM32_LPTIM2_PWM)
#  define HAVE_LPTIM
#else
#  undef HAVE_LPTIM
#endif

/* Synchronisation support */

#ifdef CONFIG_STM32_PWM_TRGO
#  define HAVE_TRGO
#endif

/* Break support */

#if defined(CONFIG_STM32_TIM1_BREAK1) || defined(CONFIG_STM32_TIM1_BREAK2) || \
    defined(CONFIG_STM32_TIM8_BREAK1) || defined(CONFIG_STM32_TIM8_BREAK2) || \
    defined(CONFIG_STM32_TIM15_BREAK1) || defined(CONFIG_STM32_TIM16_BREAK1) || \
    defined(CONFIG_STM32_TIM17_BREAK1)
#  defined HAVE_BREAK
#endif

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
#  define pwm_dumpgpio(p,m) stm32_dumpgpio(p,m)
#else
#  define pwm_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* PWM output configuration */

struct stm32_pwm_out_s
{
  uint8_t  in_use:1;                    /* Output in use */
  uint8_t  pol:1;                       /* Polarity. Default: positive */
  uint8_t  idle:1;                      /* Idle state. Default: inactive */
  uint8_t  _res:5;                      /* Reserved */
  uint32_t pincfg;                      /* Output pin configuration */
};

/* PWM channel configuration */

struct stm32_pwmchan_s
{
  uint8_t                    channel:4;   /* Timer output channel: {1,..4} */
  uint8_t                    mode:4;      /* PWM channel mode (see stm32_pwm_chanmode_e) */
  struct stm32_pwm_out_s   out1;          /* PWM output configuration */
#ifdef HAVE_BREAK
  struct stm32_pwm_break_s brk;         /* PWM break configuration */
#endif
#ifdef HAVE_PWM_COMPLEMENTARY
  struct stm32_pwm_out_s   out2;        /* PWM complementary output configuration */
#endif
};

/* This structure represents the state of one PWM timer */

struct stm32_pwmtimer_s
{
  const struct pwm_ops_s *ops;      /* PWM operations */
#ifdef CONFIG_STM32_PWM_LL_OPS
  const struct stm32_pwm_ops_s *llops; /* Low-level PWM ops */
#endif
  struct stm32_pwmchan_s *channels; /* Channels configuration */

  uint8_t  timid:5;                     /* Timer ID {1,...,17} */
  uint8_t  chan_num:3;                  /* Number of configured channels */
  uint8_t  timtype:3;                   /* See the TIMTYPE_* definitions */
  uint8_t  mode:3;                      /* Timer mode (see stm32_pwm_tim_mode_e) */
  uint8_t  lock:2;                      /* TODO: Lock configuration */
  uint8_t  t_dts:3;                     /* Clock division for t_DTS */
  uint8_t  _res:5;                      /* Reserved */
#ifdef HAVE_PWM_COMPLEMENTARY
  uint8_t  deadtime;                    /* Dead-time value */
#endif
#ifdef HAVE_TRGO
  uint8_t  trgo;                        /* TRGO configuration:
                                         * 4 LSB = TRGO, 4 MSB = TRGO2
                                         */
#endif
  uint32_t frequency;                  /* Current frequency setting */
  uint32_t base;                       /* The base address of the timer */
  uint32_t pclk;                       /* Frequency of the peripheral clock
                                        * that drives the timer module. */
};

/****************************************************************************
 * Static Function Prototypes
 ****************************************************************************/

/* Register access */

