apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
static struct stm32_pwmtimer_s g_pwm1dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 1,
  .chan_num    = PWM_TIM1_NCHANNELS,
  .channels    = g_pwm1channels,
  .timtype     = TIMTYPE_TIM1,
  .mode        = CONFIG_STM32_TIM1_MODE,
  .lock        = CONFIG_STM32_TIM1_LOCK,
  .t_dts       = CONFIG_STM32_TIM1_TDTS,
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = CONFIG_STM32_TIM1_DEADTIME,
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM1_TRGO)
  .trgo        = STM32_TIM1_TRGO,
#endif
  .base        = STM32_TIM1_BASE,
  .pclk        = STM32_TIM1_CLKIN,
};
#endif /* CONFIG_STM32_TIM1_PWM */

#ifdef CONFIG_STM32_TIM2_PWM

static struct stm32_pwmchan_s g_pwm2channels[] =
{
  /* TIM2 has 4 channels */

#ifdef CONFIG_STM32_TIM2_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM2_CH1MODE,
#ifdef CONFIG_STM32_TIM2_CH1OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH1POL,
      .idle    = CONFIG_STM32_TIM2_CH1IDLE,
      .pincfg  = PWM_TIM2_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM2_CH2MODE,
#ifdef CONFIG_STM32_TIM2_CH2OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH2POL,
      .idle    = CONFIG_STM32_TIM2_CH2IDLE,
      .pincfg  = PWM_TIM2_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM2_CH3MODE,
#ifdef CONFIG_STM32_TIM2_CH3OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH3POL,
      .idle    = CONFIG_STM32_TIM2_CH3IDLE,
      .pincfg  = PWM_TIM2_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM2_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM2_CH4MODE,
#ifdef CONFIG_STM32_TIM2_CH4OUT
    .out1 =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM2_CH4POL,
      .idle    = CONFIG_STM32_TIM2_CH4IDLE,
      .pincfg  = PWM_TIM2_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm2dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 2,
  .chan_num    = PWM_TIM2_NCHANNELS,
  .channels    = g_pwm2channels,
  .timtype     = TIMTYPE_TIM2,
  .mode        = CONFIG_STM32_TIM2_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM2_TRGO)
  .trgo        = STM32_TIM2_TRGO,
#endif
  .base        = STM32_TIM2_BASE,
  .pclk        = STM32_TIM2_CLKIN,
};

#endif /* CONFIG_STM32_TIM2_PWM */

#ifdef CONFIG_STM32_TIM3_PWM

static struct stm32_pwmchan_s g_pwm3channels[] =
{
  /* TIM3 has 4 channels */

#ifdef CONFIG_STM32_TIM3_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM3_CH1MODE,
#ifdef CONFIG_STM32_TIM3_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH1POL,
      .idle    = CONFIG_STM32_TIM3_CH1IDLE,
      .pincfg  = PWM_TIM3_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM3_CH2MODE,
#ifdef CONFIG_STM32_TIM3_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH2POL,
      .idle    = CONFIG_STM32_TIM3_CH2IDLE,
      .pincfg  = PWM_TIM3_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM3_CH3MODE,
#ifdef CONFIG_STM32_TIM3_CH3OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH3POL,
      .idle    = CONFIG_STM32_TIM3_CH3IDLE,
      .pincfg  = PWM_TIM3_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM3_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM3_CH4MODE,
#ifdef CONFIG_STM32_TIM3_CH4OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM3_CH4POL,
      .idle    = CONFIG_STM32_TIM3_CH4IDLE,
      .pincfg  = PWM_TIM3_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm3dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 3,
  .chan_num    = PWM_TIM3_NCHANNELS,
  .channels    = g_pwm3channels,
  .timtype     = TIMTYPE_TIM3,
  .mode        = CONFIG_STM32_TIM3_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM3_TRGO)
  .trgo        = STM32_TIM3_TRGO,
#endif
  .base        = STM32_TIM3_BASE,
  .pclk        = STM32_TIM3_CLKIN,
};
#endif /* CONFIG_STM32_TIM3_PWM */

#ifdef CONFIG_STM32_TIM4_PWM

static struct stm32_pwmchan_s g_pwm4channels[] =
{
  /* TIM4 has 4 channels */

#ifdef CONFIG_STM32_TIM4_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM4_CH1MODE,
#ifdef CONFIG_STM32_TIM4_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH1POL,
      .idle    = CONFIG_STM32_TIM4_CH1IDLE,
      .pincfg  = PWM_TIM4_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL2
  {
    .channel = 2,
    .mode    = CONFIG_STM32_TIM4_CH2MODE,
#ifdef CONFIG_STM32_TIM4_CH2OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH2POL,
      .idle    = CONFIG_STM32_TIM4_CH2IDLE,
      .pincfg  = PWM_TIM4_CH2CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL3
  {
    .channel = 3,
    .mode    = CONFIG_STM32_TIM4_CH3MODE,
#ifdef CONFIG_STM32_TIM4_CH3OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH3POL,
      .idle    = CONFIG_STM32_TIM4_CH3IDLE,
      .pincfg  = PWM_TIM4_CH3CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
#ifdef CONFIG_STM32_TIM4_CHANNEL4
  {
    .channel = 4,
    .mode    = CONFIG_STM32_TIM4_CH4MODE,
#ifdef CONFIG_STM32_TIM4_CH4OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM4_CH4POL,
      .idle    = CONFIG_STM32_TIM4_CH4IDLE,
      .pincfg  = PWM_TIM4_CH4CFG,
    }
#endif
    /* No complementary outputs */
  }
#endif
};

static struct stm32_pwmtimer_s g_pwm4dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 4,
  .chan_num    = PWM_TIM4_NCHANNELS,
  .channels    = g_pwm4channels,
  .timtype     = TIMTYPE_TIM4,
  .mode        = CONFIG_STM32_TIM4_MODE,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO) && defined(STM32_TIM4_TRGO)
  .trgo        = STM32_TIM4_TRGO,
#endif
  .base        = STM32_TIM4_BASE,
  .pclk        = STM32_TIM4_CLKIN,
};
