apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
#ifdef CONFIG_STM32_TIM16_PWM

static struct stm32_pwmchan_s g_pwm16channels[] =
{
  /* TIM16 has 1 channel, 1 complementary */

#ifdef CONFIG_STM32_TIM16_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM16_CH1MODE,
#ifdef HAVE_BREAK
    .brk =
    {
#ifdef CONFIG_STM32_TIM16_BREAK1
      .en1 = 1,
      .pol1 = CONFIG_STM32_TIM16_BRK1POL,
#endif
      /* No BREAK2 */
    },
#endif
#ifdef CONFIG_STM32_TIM16_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM16_CH1POL,
      .idle    = CONFIG_STM32_TIM16_CH1IDLE,
      .pincfg  = PWM_TIM16_CH1CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM16_CH1NOUT
    .out2    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM16_CH1NPOL,
      .idle    = CONFIG_STM32_TIM16_CH1NIDLE,
      .pincfg  = PWM_TIM16_CH2CFG,
    }
#endif
  },
#endif
};

static struct stm32_pwmtimer_s g_pwm16dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 16,
  .chan_num    = PWM_TIM16_NCHANNELS,
  .channels    = g_pwm16channels,
  .timtype     = TIMTYPE_TIM16,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = CONFIG_STM32_TIM16_LOCK,
  .t_dts       = CONFIG_STM32_TIM16_TDTS,
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = CONFIG_STM32_TIM16_DEADTIME,
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM16 */
#endif
  .base        = STM32_TIM16_BASE,
  .pclk        = STM32_TIM16_CLKIN,
};
#endif /* CONFIG_STM32_TIM16_PWM */

#ifdef CONFIG_STM32_TIM17_PWM

static struct stm32_pwmchan_s g_pwm17channels[] =
{
  /* TIM17 has 1 channel, 1 complementary */

#ifdef CONFIG_STM32_TIM17_CHANNEL1
  {
    .channel = 1,
    .mode    = CONFIG_STM32_TIM17_CH1MODE,
#ifdef HAVE_BREAK
    .brk =
    {
#ifdef CONFIG_STM32_TIM17_BREAK1
      .en1 = 1,
      .pol1 = CONFIG_STM32_TIM17_BRK1POL,
#endif
      /* No BREAK2 */
    },
#endif
#ifdef CONFIG_STM32_TIM17_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM17_CH1POL,
      .idle    = CONFIG_STM32_TIM17_CH1IDLE,
      .pincfg  = PWM_TIM17_CH1CFG,
    },
#endif
#ifdef CONFIG_STM32_TIM17_CH1NOUT
    .out2    =
    {
      .in_use  = 1,
      .pol     = CONFIG_STM32_TIM17_CH1NPOL,
      .idle    = CONFIG_STM32_TIM17_CH1NIDLE,
      .pincfg  = PWM_TIM17_CH2CFG,
    }
#endif
  },
#endif
};

static struct stm32_pwmtimer_s g_pwm17dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 17,
  .chan_num    = PWM_TIM17_NCHANNELS,
  .channels    = g_pwm17channels,
  .timtype     = TIMTYPE_TIM17,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = CONFIG_STM32_TIM17_LOCK,
  .t_dts       = CONFIG_STM32_TIM17_TDTS,
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = CONFIG_STM32_TIM17_DEADTIME,
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for TIM17 */
#endif
  .base        = STM32_TIM17_BASE,
  .pclk        = STM32_TIM17_CLKIN,
};
#endif /* CONFIG_STM32_TIM17_PWM */

#ifdef CONFIG_STM32_LPTIM1_PWM

static struct stm32_pwmchan_s g_pwmlp1channels[] =
{
  /* LPTIM1 has 1 channel */

#ifdef CONFIG_STM32_LPTIM1_CHANNEL1
  {
    .channel = 1,
    .mode    = 0,
#ifdef CONFIG_STM32_LPTIM1_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = 0,             /* REVISIT: Configure using CONFIG_STM32_LPTIM1_CH1POL, */
      .idle    = 0,             /* No idle */
      .pincfg  = PWM_LPTIM1_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
};

static struct stm32_pwmtimer_s g_pwmlp1dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 1,
  .chan_num    = PWM_LPTIM1_NCHANNELS,
  .channels    = g_pwmlp1channels,
  .timtype     = TIMTYPE_LPTIM1,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for LPTIM1 */
#endif
  .base        = STM32_LPTIM1_BASE,
#if defined(CONFIG_STM32_LPTIM1_CLK_APB1)
  .pclk        = STM32_PCLK1_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM1_CLK_LSE)
  .pclk        = STM32_LSE_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM1_CLK_LSI)
  .pclk        = STM32_LSI_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM1_CLK_HSI)
  .pclk        = STM32_HSI_FREQUENCY,
#endif
};
#endif /* CONFIG_STM32_LPTIM1_PWM */

#ifdef CONFIG_STM32_LPTIM2_PWM

static struct stm32_pwmchan_s g_pwmlp2channels[] =
{
  /* LPTIM2 has 1 channel */

#ifdef CONFIG_STM32_LPTIM2_CHANNEL1
  {
    .channel = 1,
    .mode    = 0,
#ifdef CONFIG_STM32_LPTIM2_CH1OUT
    .out1    =
    {
      .in_use  = 1,
      .pol     = 0,             /* REVISIT: Configure using CONFIG_STM32_LPTIM2_CH1POL, */
      .idle    = 0,             /* No idle */
      .pincfg  = PWM_LPTIM2_CH1CFG,
    }
#endif
    /* No complementary outputs */
  },
#endif
};

static struct stm32_pwmtimer_s g_pwmlp2dev =
{
  .ops         = &g_pwmops,
#ifdef CONFIG_STM32_PWM_LL_OPS
  .llops       = &g_llpwmops,
#endif
  .timid       = 2,
  .chan_num    = PWM_LPTIM2_NCHANNELS,
  .channels    = g_pwmlp2channels,
  .timtype     = TIMTYPE_LPTIM2,
  .mode        = STM32_TIMMODE_COUNTUP,
  .lock        = 0,             /* No lock */
  .t_dts       = 0,             /* No t_dts */
#ifdef HAVE_PWM_COMPLEMENTARY
  .deadtime    = 0,             /* No deadtime */
#endif
#if defined(HAVE_TRGO)
  .trgo        = 0,             /* TRGO not supported for LPTIM2 */
#endif
  .base        = STM32_LPTIM2_BASE,
#if defined(CONFIG_STM32_LPTIM2_CLK_APB1)
  .pclk        = STM32_PCLK1_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM2_CLK_LSE)
  .pclk        = STM32_LSE_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM2_CLK_LSI)
  .pclk        = STM32_LSI_FREQUENCY,
#elif defined(CONFIG_STM32_LPTIM2_CLK_HSI)
  .pclk        = STM32_HSI_FREQUENCY,
#endif
};
