apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
#endif /* CONFIG_STM32_LPTIM2_PWM */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pwm_getreg
 *
 * Description:
 *   Read the value of an PWM timer register.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint16_t pwm_getreg(struct stm32_pwmtimer_s *priv, int offset)
{
  return getreg16(priv->base + offset);
}

/****************************************************************************
 * Name: pwm_putreg
 *
 * Description:
 *   Read the value of an PWM timer register.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void pwm_putreg(struct stm32_pwmtimer_s *priv, int offset,
                              uint16_t value)
{
  if (priv->timtype == TIMTYPE_GENERAL32 &&
      (offset == STM32_GTIM_CNT_OFFSET ||
       offset == STM32_GTIM_ARR_OFFSET ||
       offset == STM32_GTIM_CCR1_OFFSET ||
       offset == STM32_GTIM_CCR2_OFFSET ||
       offset == STM32_GTIM_CCR3_OFFSET ||
       offset == STM32_GTIM_CCR4_OFFSET))
    {
      /* a 32 bit access is required for a 32 bit register:
       * if only a 16 bit write would be performed, then the
       * upper 16 bits of the 32 bit register will be a copy of
       * the lower 16 bits.
       */

      putreg32(value, priv->base + offset);
    }
  else
    {
      putreg16(value, priv->base + offset);
    }
}

/****************************************************************************
 * Name: pwm_modifyreg
 *
 * Description:
 *   Modify PWM register (32-bit or 16-bit)
 *
 * Input Parameters:
 *   priv    - A reference to the PWM block status
 *   offset  - The offset to the register to read
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void pwm_modifyreg(struct stm32_pwmtimer_s *priv, uint32_t offset,
                          uint32_t clearbits, uint32_t setbits)
{
  if (priv->timtype == TIMTYPE_GENERAL32 &&
      (offset == STM32_GTIM_CNT_OFFSET ||
       offset == STM32_GTIM_ARR_OFFSET ||
       offset == STM32_GTIM_CCR1_OFFSET ||
       offset == STM32_GTIM_CCR2_OFFSET ||
       offset == STM32_GTIM_CCR3_OFFSET ||
       offset == STM32_GTIM_CCR4_OFFSET))
    {
      /* a 32 bit access is required for a 32 bit register:
       * if only a 16 bit write would be performed, then the
       * upper 16 bits of the 32 bit register will be a copy of
       * the lower 16 bits.
       */

      modifyreg32(priv->base + offset, clearbits, setbits);
    }
  else
    {
      modifyreg16(priv->base + offset, (uint16_t)clearbits,
                  (uint16_t)setbits);
    }
}

/****************************************************************************
 * Name: pwm_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
static void pwm_dumpregs(struct pwm_lowerhalf_s *dev,
                         const char *msg)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

  if (priv->timtype == TIMTYPE_LOWPOWER)
    {
      pwminfo("%s:\n", msg);
      pwminfo("  CFGR: %04x CR:  %04x CMP:  %04x ARR:  %04x\n",
              pwm_getreg(priv, STM32_LPTIM_CFGR_OFFSET),
              pwm_getreg(priv, STM32_LPTIM_CR_OFFSET),
              pwm_getreg(priv, STM32_LPTIM_CMP_OFFSET),
              pwm_getreg(priv, STM32_LPTIM_ARR_OFFSET));
      pwminfo("  ISR:  %04x CNT: %04x\n",
              pwm_getreg(priv, STM32_LPTIM_ISR_OFFSET),
              pwm_getreg(priv, STM32_LPTIM_CNT_OFFSET));
    }
  else
    {
      pwminfo("%s:\n", msg);
      pwminfo("  CR1: %04x CR2:  %04x SMCR:  %04x DIER:  %04x\n",
              pwm_getreg(priv, STM32_GTIM_CR1_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CR2_OFFSET),
              pwm_getreg(priv, STM32_GTIM_SMCR_OFFSET),
              pwm_getreg(priv, STM32_GTIM_DIER_OFFSET));
      pwminfo("   SR: %04x EGR:  %04x CCMR1: %04x CCMR2: %04x\n",
              pwm_getreg(priv, STM32_GTIM_SR_OFFSET),
              pwm_getreg(priv, STM32_GTIM_EGR_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CCMR1_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CCMR2_OFFSET));
      pwminfo(" CCER: %04x CNT:  %04x PSC:   %04x ARR:   %04x\n",
              pwm_getreg(priv, STM32_GTIM_CCER_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CNT_OFFSET),
              pwm_getreg(priv, STM32_GTIM_PSC_OFFSET),
              pwm_getreg(priv, STM32_GTIM_ARR_OFFSET));
      pwminfo(" CCR1: %04x CCR2: %04x CCR3:  %04x CCR4:  %04x\n",
              pwm_getreg(priv, STM32_GTIM_CCR1_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CCR2_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CCR3_OFFSET),
              pwm_getreg(priv, STM32_GTIM_CCR4_OFFSET));
#if defined(CONFIG_STM32_TIM1_PWM) || defined(CONFIG_STM32_TIM8_PWM)
      if (priv->timtype == TIMTYPE_ADVANCED)
        {
          pwminfo("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
              pwm_getreg(priv, STM32_ATIM_RCR_OFFSET),
              pwm_getreg(priv, STM32_ATIM_BDTR_OFFSET),
              pwm_getreg(priv, STM32_ATIM_DCR_OFFSET),
              pwm_getreg(priv, STM32_ATIM_DMAR_OFFSET));
        }
      else
#endif
        {
          pwminfo("  DCR: %04x DMAR: %04x\n",
              pwm_getreg(priv, STM32_GTIM_DCR_OFFSET),
              pwm_getreg(priv, STM32_GTIM_DMAR_OFFSET));
        }
    }
}
#endif

/****************************************************************************
 * Name: pwm_ccr_update
 ****************************************************************************/

static int pwm_ccr_update(struct pwm_lowerhalf_s *dev, uint8_t index,
                          uint32_t ccr)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint32_t offset = 0;

#ifdef HAVE_LPTIM
  if (priv->timtype == TIMTYPE_LOWPOWER)
    {
      /* REVISIT: What about index? Is it necessary for LPTIM? */

