apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
      offset = STM32_LPTIM_CMP_OFFSET;
      pwm_putreg(priv, offset, ccr);

      return OK;
    }
#endif

  /* Only ADV timers have CC5 and CC6 */

  if (priv->timtype != TIMTYPE_ADVANCED && (index == 5 || index == 6))
    {
      pwmerr("ERROR: No such CCR: %u\n", index);
      return -EINVAL;
    }

  /* REVISIT: start index from 0? */

  switch (index)
    {
      case STM32_PWM_CHAN1:
        {
          offset = STM32_GTIM_CCR1_OFFSET;
          break;
        }

      case STM32_PWM_CHAN2:
        {
          offset = STM32_GTIM_CCR2_OFFSET;
          break;
        }

      case STM32_PWM_CHAN3:
        {
          offset = STM32_GTIM_CCR3_OFFSET;
          break;
        }

      case STM32_PWM_CHAN4:
        {
          offset = STM32_GTIM_CCR4_OFFSET;
          break;
        }

      case STM32_PWM_CHAN5:
        {
          offset = STM32_ATIM_CCR5_OFFSET;
          break;
        }

      case STM32_PWM_CHAN6:
        {
          offset = STM32_ATIM_CCR6_OFFSET;
          break;
        }

      default:
        {
          pwmerr("ERROR: No such CCR: %u\n", index);
          return -EINVAL;
        }
    }

  /* Update CCR register */

  pwm_putreg(priv, offset, ccr);

  return OK;
}

/****************************************************************************
 * Name: pwm_ccr_get
 ****************************************************************************/

#ifdef CONFIG_STM32_PWM_LL_OPS
static uint32_t pwm_ccr_get(struct pwm_lowerhalf_s *dev, uint8_t index)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint32_t offset = 0;

  switch (index)
    {
      case STM32_PWM_CHAN1:
        {
          offset = STM32_GTIM_CCR1_OFFSET;
          break;
        }

      case STM32_PWM_CHAN2:
        {
          offset = STM32_GTIM_CCR2_OFFSET;
          break;
        }

      case STM32_PWM_CHAN3:
        {
          offset = STM32_GTIM_CCR3_OFFSET;
          break;
        }

      case STM32_PWM_CHAN4:
        {
          offset = STM32_GTIM_CCR4_OFFSET;
          break;
        }

      case STM32_PWM_CHAN5:
        {
          offset = STM32_ATIM_CCR5_OFFSET;
          break;
        }

      case STM32_PWM_CHAN6:
        {
          offset = STM32_ATIM_CCR6_OFFSET;
          break;
        }

      default:
        {
          pwmerr("ERROR: No such CCR: %u\n", index);
          return -EINVAL;
        }
    }

  /* Return CCR register */

  return pwm_getreg(priv, offset);
}
#endif /* CONFIG_STM32_PWM_LL_OPS */

/****************************************************************************
 * Name: pwm_arr_update
 ****************************************************************************/

static int pwm_arr_update(struct pwm_lowerhalf_s *dev, uint32_t arr)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

  /* Update ARR register */

  if (priv->timtype == TIMTYPE_LOWPOWER)
    {
      pwm_putreg(priv, STM32_LPTIM_ARR_OFFSET, arr);
    }
  else
    {
      pwm_putreg(priv, STM32_GTIM_ARR_OFFSET, arr);
    }

  return OK;
}

/****************************************************************************
 * Name: pwm_arr_get
 ****************************************************************************/

static uint32_t pwm_arr_get(struct pwm_lowerhalf_s *dev)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

  if (priv->timtype == TIMTYPE_LOWPOWER)
    {
      return pwm_getreg(priv, STM32_LPTIM_ARR_OFFSET);
    }
  else
    {
      return pwm_getreg(priv, STM32_GTIM_ARR_OFFSET);
    }
}

/****************************************************************************
 * Name: pwm_duty_update
 *
 * Description:
 *   Try to change only channel duty
 *
 * Input Parameters:
 *   dev     - A reference to the lower half PWM driver state structure
 *   channel - Channel to by updated
 *   duty    - New duty
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_duty_update(struct pwm_lowerhalf_s *dev, uint8_t channel,
                           ub16_t duty)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint32_t reload = 0;
  uint32_t ccr    = 0;

  /* We don't want compilation warnings if no DEBUGASSERT */

  UNUSED(priv);

  DEBUGASSERT(priv != NULL);

  pwminfo("TIM%u channel: %u duty: %08" PRIx32 "\n",
          priv->timid, channel, duty);

  /* Get the reload values */

  reload = pwm_arr_get(dev);

  /* Duty cycle:
   *
   * duty cycle = ccr / reload (fractional value)
   */

  ccr = b16toi(duty * reload + b16HALF);

  pwminfo("ccr: %" PRIu32 "\n", ccr);

  /* Write corresponding CCR register */

  pwm_ccr_update(dev, channel, ccr);

  return OK;
}

/****************************************************************************
 * Name: pwm_timer_enable
 ****************************************************************************/

static int pwm_timer_enable(struct pwm_lowerhalf_s *dev, bool state)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

#ifdef HAVE_LPTIM
  if (priv->timtype != TIMTYPE_LOWPOWER)
    {
#endif
      if (state == true)
        {
          /* Enable timer counter */

          pwm_modifyreg(priv, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_CEN);
        }
      else
        {
          /* Disable timer counter */

          pwm_modifyreg(priv, STM32_GTIM_CR1_OFFSET, GTIM_CR1_CEN, 0);
        }
#ifdef HAVE_LPTIM
    }
  else
    {
      if (state == true)
        {
          /* Enable timer counter */

          pwm_modifyreg(priv, STM32_LPTIM_CR_OFFSET, 0, LPTIM_CR_ENABLE);
        }
      else
        {
          /* Disable timer counter */

          pwm_modifyreg(priv, STM32_LPTIM_CR_OFFSET, LPTIM_CR_ENABLE, 0);
        }
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: pwm_frequency_update
 *
 * Description:
 *   Update a PWM timer frequency
 *
 ****************************************************************************/

static int pwm_frequency_update(struct pwm_lowerhalf_s *dev,
                                uint32_t frequency)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint32_t reload    = 0;
  uint32_t timclk    = 0;
  uint32_t prescaler = 0;

  /* Calculate optimal values for the timer prescaler and for the timer
   * reload register. If 'frequency' is the desired frequency, then
   *
   *   reload = timclk / frequency
   *   timclk = pclk / presc
   *
   * Or,
   *
   *   reload = pclk / presc / frequency
   *
   * There are many solutions to this, but the best solution will be the one
   * that has the largest reload value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   0 <= presc  <= 65536
   *   1 <= reload <= 65535
   *
   * So presc = pclk / 65535 / frequency would be optimal.
   *
   * Example:
   *
   *  pclk      = 42 MHz
   *  frequency = 100 Hz
   *
   *  prescaler = 42,000,000 / 65,535 / 100
   *            = 6.4 (or 7 -- taking the ceiling always)
   *  timclk    = 42,000,000 / 7
   *            = 6,000,000
   *  reload    = 6,000,000 / 100
   *            = 60,000
   */

  /* If timer mode is center aligned the frequency of PWM is the half of
   * intended so multiply by x2
   */

  if ((priv->mode == STM32_TIMMODE_CENTER1) ||
      (priv->mode == STM32_TIMMODE_CENTER2) ||
      (priv->mode == STM32_TIMMODE_CENTER3))
    {
      frequency = frequency * 2;
    }

  prescaler = (priv->pclk / frequency + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = priv->pclk / prescaler;

  reload = timclk / frequency;
  if (reload < 2)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }
  else
    {
      reload--;
    }

  pwminfo("TIM%u PCLK: %" PRIu32 " frequency: %" PRIu32 " TIMCLK: %" PRIu32
          " prescaler: %" PRIu32 " reload: %" PRIu32 "\n",
          priv->timid, priv->pclk, frequency, timclk, prescaler, reload);

  /* Set the reload and prescaler values */

  pwm_arr_update(dev, reload);
  pwm_putreg(priv, STM32_GTIM_PSC_OFFSET, (uint16_t)(prescaler - 1));

  return OK;
}

/****************************************************************************
 * Name: pwm_lp_frequency_update
 *
 * Description:
 *   Update a PWM timer frequency
 *
 ****************************************************************************/

#ifdef HAVE_LPTIM
static int pwm_lp_frequency_update(struct pwm_lowerhalf_s *dev,
                                uint32_t frequency)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

  /* Calculated values */

  uint8_t prescaler;
  uint32_t timclk;
  uint32_t reload;

  /* Register contents */

  uint32_t cfgr;

  /* LPTIM only has 8 possible prescaler values, from /1 to /128
   * We will attempt to find the lowest prescaler that results
   * in a maximum reload value which can be represented in 16 bit.
   * For certain desired frequencies it is possible that the clock
   * is too high and other one needs to be selected.
   */

