apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
  /* PWM mode configuration */

  switch (channel)
    {
      /* Get CCMR offset */

      case STM32_PWM_CHAN1:
      case STM32_PWM_CHAN2:
        {
          offset = STM32_GTIM_CCMR1_OFFSET;
          break;
        }

      case STM32_PWM_CHAN3:
      case STM32_PWM_CHAN4:
        {
          offset = STM32_GTIM_CCMR2_OFFSET;
          break;
        }

      case STM32_PWM_CHAN5:
      case STM32_PWM_CHAN6:
        {
          offset = STM32_ATIM_CCMR3_OFFSET;
          break;
        }

      default:
        {
          pwmerr("ERROR: No such channel: %u\n", channel);
          ret = -EINVAL;
          goto errout;
        }
    }

  /* Get current registers */

  ccmr = pwm_getreg(priv, offset);

  /* PWM mode configuration.
   * NOTE: The CCMRx registers are identical if the channels are outputs.
   */

  switch (channel)
    {
      /* Configure channel 1/3/5 */

      case STM32_PWM_CHAN1:
      case STM32_PWM_CHAN3:
      case STM32_PWM_CHAN5:
        {
          /* Reset current channel 1/3/5 mode configuration */

          ccmr &= ~(GTIM_CCMR1_CC1S_MASK | GTIM_CCMR1_OC1M_MASK |
                     GTIM_CCMR1_OC1PE);

          /* Configure CC1/3/5 as output */

          ocmode |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC1S_SHIFT);

          /* Configure Compare 1/3/5 mode */

          ocmode |= (chanmode << GTIM_CCMR1_OC1M_SHIFT);

          /* Enable CCR1/3/5 preload */

          ocmode |= GTIM_CCMR1_OC1PE;

          /* Reset current OC bit */

          ccmr &= ~(GTIM_CCMR1_OC1M);

          /* Set an additional OC1/3/5M bit */

          if (ocmbit)
            {
              ocmode |= GTIM_CCMR1_OC1M;
            }
          break;
        }

      /* Configure channel 2/4/6 */

      case STM32_PWM_CHAN2:
      case STM32_PWM_CHAN4:
      case STM32_PWM_CHAN6:
        {
          /* Reset current channel 2/4/6 mode configuration */

          ccmr &= ~(GTIM_CCMR1_CC2S_MASK | GTIM_CCMR1_OC2M_MASK |
                     GTIM_CCMR1_OC2PE);

          /* Configure CC2/4/6 as output */

          ocmode |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC2S_SHIFT);

          /* Configure Compare 2/4/6 mode */

          ocmode |= (chanmode << GTIM_CCMR1_OC2M_SHIFT);

          /* Enable CCR2/4/6 preload */

          ocmode |= GTIM_CCMR1_OC2PE;

          /* Reset current OC bit */

          ccmr &= ~(GTIM_CCMR1_OC2M);

          /* Set an additioneal OC2/4/6M bit */

          if (ocmbit)
            {
              ocmode |= GTIM_CCMR1_OC2M;
            }
          break;
        }
    }

  /* Set the selected output compare mode */

  ccmr |= ocmode;

  /* Write CCMRx registers */

  pwm_putreg(priv, offset, ccmr);

errout:
  return ret;
}

/****************************************************************************
 * Name: pwm_output_configure
 *
 * Description:
 *   Configure PWM output for given channel
 *
 ****************************************************************************/

static int pwm_output_configure(struct stm32_pwmtimer_s *priv,
                                uint8_t channel)
{
  uint32_t cr2  = 0;
  uint32_t ccer = 0;

  /* Get current registers state */

  cr2  = pwm_getreg(priv, STM32_GTIM_CR2_OFFSET);
  ccer = pwm_getreg(priv, STM32_GTIM_CCER_OFFSET);

  /* | OISx/OISxN  | IDLE | for ADVANCED and COUNTUP16 | CR2 register
   * | CCxP/CCxNP  | POL  | all PWM timers             | CCER register
   */

  /* Configure output polarity (all PWM timers) */

  if (priv->channels[channel - 1].out1.pol == STM32_POL_NEG)
    {
      ccer |= (GTIM_CCER_CC1P << ((channel - 1) * 4));
    }
  else
    {
      ccer &= ~(GTIM_CCER_CC1P << ((channel - 1) * 4));
    }

#ifdef HAVE_ADVTIM
  if (priv->timtype == TIMTYPE_ADVANCED ||
      priv->timtype == TIMTYPE_COUNTUP16_N)
    {
      /* Configure output IDLE State */

      if (priv->channels[channel - 1].out1.idle == STM32_IDLE_ACTIVE)
        {
          cr2 |= (ATIM_CR2_OIS1 << ((channel - 1) * 2));
        }
      else
        {
          cr2 &= ~(ATIM_CR2_OIS1 << ((channel - 1) * 2));
        }

#ifdef HAVE_PWM_COMPLEMENTARY
      /* Configure complementary output IDLE state */

      if (priv->channels[channel - 1].out2.idle == STM32_IDLE_ACTIVE)
        {
          cr2 |= (ATIM_CR2_OIS1N << ((channel - 1) * 2));
        }
      else
        {
          cr2 &= ~(ATIM_CR2_OIS1N << ((channel - 1)* 2));
        }

      /* Configure complementary output polarity */

      if (priv->channels[channel - 1].out2.pol == STM32_POL_NEG)
        {
          ccer |= (ATIM_CCER_CC1NP << ((channel - 1) * 4));
        }
      else
        {
          ccer &= ~(ATIM_CCER_CC1NP << ((channel - 1) * 4));
        }
#endif /* HAVE_PWM_COMPLEMENTARY */

      /* TODO: OIS5 and OIS6 */

      cr2 &= ~(ATIM_CR2_OIS5 | ATIM_CR2_OIS6);

      /* TODO: CC5P and CC6P */

      ccer &= ~(ATIM_CCER_CC5P | ATIM_CCER_CC6P);
    }
#ifdef HAVE_GTIM_CCXNP
  else
#endif /* HAVE_GTIM_CCXNP */
#endif /* HAVE_ADVTIM */
#ifdef HAVE_GTIM_CCXNP
    {
      /* CCxNP must be cleared if not ADVANCED timer.
       *
       * REVISIT: not all families have CCxNP bits for GTIM,
       *          which causes an ugly condition above
       */

      ccer &= ~(GTIM_CCER_CC1NP << ((channel - 1) * 4));
    }
#endif /* HAVE_GTIM_CCXNP */

  /* Write registers */

  pwm_modifyreg(priv, STM32_GTIM_CR2_OFFSET, 0, cr2);
  pwm_modifyreg(priv, STM32_GTIM_CCER_OFFSET, 0, ccer);

  return OK;
}

/****************************************************************************
 * Name: pwm_outputs_enable
 *
 * Description:
 *   Enable/disable given timer PWM outputs.
 *
 *   NOTE: This is bulk operation - we can enable/disable many outputs
 *   at one time
 *
 * Input Parameters:
 *   dev     - A reference to the lower half PWM driver state structure
 *   outputs - outputs to set (look at enum stm32_chan_e in stm32l4_pwm.h)
 *   state   - Enable/disable operation
 *
 ****************************************************************************/

static int pwm_outputs_enable(struct pwm_lowerhalf_s *dev,
                              uint16_t outputs, bool state)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint32_t ccer   = 0;
  uint32_t regval = 0;

  /* Get current register state */

  ccer = pwm_getreg(priv, STM32_GTIM_CCER_OFFSET);

