apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
  /* Just enable the timer, leaving all interrupts disabled */

  pwm_timer_enable(dev, true);

  pwm_dumpregs(dev, "After starting");

errout:
  return ret;
}

/****************************************************************************
 * Name: pwm_lptimer
 *
 * Description:
 *   (Re-)initialize the low-power timer resources and start the
 *   pulsed output
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

#ifdef HAVE_LPTIM
static int pwm_lptimer(struct pwm_lowerhalf_s *dev,
                       const struct pwm_info_s *info)
{
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;
  uint16_t cr;
  int      ret     = OK;

  DEBUGASSERT(priv != NULL && info != NULL);

  pwminfo("LPTIM%u frequency: %u\n",
          priv->timid, info->frequency);

  DEBUGASSERT(info->frequency > 0);

  /* Enable again, ARR and CMP need to be written while enabled */

  pwm_timer_enable(dev, true);

  /* Set timer frequency */

  ret = pwm_lp_frequency_update(dev, info->frequency);
  if (ret < 0)
    {
      goto errout;
    }

  ub16_t duty = info->channels[0].duty;

  /* Update duty cycle */

  ret = pwm_duty_update(dev, priv->channels[0].channel, duty);
  if (ret < 0)
    {
      goto errout;
    }

  /* Start counter */

  cr = pwm_getreg(priv, STM32_LPTIM_CR_OFFSET);
  cr |= LPTIM_CR_CNTSTRT;
  pwm_putreg(priv, STM32_LPTIM_CR_OFFSET, cr);

  pwm_dumpregs(dev, "After starting");

errout:
  return ret;
}
#endif /* HAVE_LPTIM */

/****************************************************************************
 * Name: pwm_setapbclock
 *
 * Description:
 *   Enable or disable APB clock for the timer peripheral
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 ****************************************************************************/

static int pwm_setapbclock(struct stm32_pwmtimer_s *priv,
                                  bool on)
{
  uint32_t en_bit;
  uint32_t regaddr;
  int      ret     = OK;

  /* Determine which timer to configure */

  if (priv->timtype != TIMTYPE_LOWPOWER)
    {
      switch (priv->timid)
        {
#ifdef CONFIG_STM32_TIM1_PWM
          case 1:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM1EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM2_PWM
          case 2:
            {
              regaddr  = STM32_RCC_APB1ENR1;
              en_bit   = RCC_APB1ENR1_TIM2EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM3_PWM
          case 3:
            {
              regaddr  = STM32_RCC_APB1ENR1;
              en_bit   = RCC_APB1ENR1_TIM3EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM4_PWM
          case 4:
            {
              regaddr  = STM32_RCC_APB1ENR1;
              en_bit   = RCC_APB1ENR1_TIM4EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM5_PWM
          case 5:
            {
              regaddr  = STM32_RCC_APB1ENR1;
              en_bit   = RCC_APB1ENR1_TIM5EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM8_PWM
          case 8:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM8EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM15_PWM
          case 15:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM15EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM16_PWM
          case 16:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM16EN;
              break;
            }
#endif

#ifdef CONFIG_STM32_TIM17_PWM
          case 17:
            {
              regaddr  = STM32_RCC_APB2ENR;
              en_bit   = RCC_APB2ENR_TIM17EN;
              break;
          }
#endif

          default:
          {
            pwmerr("ERROR: No such timer configured %d\n", priv->timid);
            ret = -EINVAL;
            goto errout;
          }
        }

      /* Enable/disable APB 1/2 clock for timer */

      if (on)
        {
          modifyreg32(regaddr, 0, en_bit);
        }
      else
        {
          modifyreg32(regaddr, en_bit, 0);
        }
    }
#ifdef HAVE_LPTIM
  else
    {
      uint32_t clock_bits;

      switch (priv->timid)
        {
#ifdef CONFIG_STM32_LPTIM1_PWM
          case 1:
            {
#if defined(CONFIG_STM32_LPTIM1_CLK_APB1)
              /* Enable APB clock for LPTIM1 */

              if (on)
                {
                  modifyreg32(STM32_RCC_APB1ENR1,
                              0, RCC_APB1ENR1_LPTIM1EN);
                }
              else
                {
                  modifyreg32(STM32_RCC_APB1ENR1,
                              RCC_APB1ENR1_LPTIM1EN, 0);
                }

              clock_bits = RCC_CCIPR_LPTIM1SEL_PCLK;
#elif defined(CONFIG_STM32_LPTIM1_CLK_LSI)
              clock_bits = RCC_CCIPR_LPTIM1SEL_LSI;
#elif defined(CONFIG_STM32_LPTIM1_CLK_LSE)
              clock_bits = RCC_CCIPR_LPTIM1SEL_LSE;
#elif defined(CONFIG_STM32_LPTIM1_CLK_HSI)
              clock_bits = RCC_CCIPR_LPTIM1SEL_HSI;
#endif
              /* Choose which clock will be used for LPTIM1 */

              modifyreg32(STM32_RCC_CCIPR, RCC_CCIPR_LPTIM1SEL_MASK,
                          clock_bits);
              break;
            }
#endif

#ifdef CONFIG_STM32_LPTIM2_PWM
          case 2:
            {
#if defined(CONFIG_STM32_LPTIM2_CLK_APB1)
              /* Enable APB clock for LPTIM2 */

              if (on)
                {
                  modifyreg32(STM32_RCC_APB1ENR2,
                              0, RCC_APB1ENR2_LPTIM2EN);
                }
              else
                {
                  modifyreg32(STM32_RCC_APB1ENR2,
                              RCC_APB1ENR2_LPTIM2EN, 0);
                }

              clock_bits = RCC_CCIPR_LPTIM2SEL_PCLK;
#elif defined(CONFIG_STM32_LPTIM2_CLK_LSI)
              clock_bits = RCC_CCIPR_LPTIM2SEL_LSI;
#elif defined(CONFIG_STM32_LPTIM2_CLK_LSE)
              clock_bits = RCC_CCIPR_LPTIM2SEL_LSE;
#elif defined(CONFIG_STM32_LPTIM2_CLK_HSI)
              clock_bits = RCC_CCIPR_LPTIM2SEL_HSI;
#endif
              /* Choose which clock will be used for LPTIM2 */

              modifyreg32(STM32_RCC_CCIPR, RCC_CCIPR_LPTIM2SEL_MASK,
                          clock_bits);
              break;
            }

#endif
          default:
            {
              pwmerr("ERROR: No such timer configured %d\n", priv->timid);
              ret = -EINVAL;
              goto errout;
            }
        }
    }

#endif /* HAVE_LPTIM */
errout:
  return ret;
}

/****************************************************************************
 * Name: pwm_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   APB1 or 2 clocking for the GPIOs has already been configured by the RCC
 *   logic at power up.
 *
 ****************************************************************************/

