apache/nuttx/arch/arm/src/stm32l4/stm32l4_pwm.c
  /* Determine which timer to reset */

  if (priv->timtype != TIMTYPE_LOWPOWER)
    {
      switch (priv->timid)
        {
#ifdef CONFIG_STM32_TIM1_PWM
          case 1:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM1RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM2_PWM
          case 2:
            regaddr  = STM32_RCC_APB1RSTR1;
            resetbit = RCC_APB1RSTR1_TIM2RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM3_PWM
          case 3:
            regaddr  = STM32_RCC_APB1RSTR1;
            resetbit = RCC_APB1RSTR1_TIM3RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM4_PWM
          case 4:
            regaddr  = STM32_RCC_APB1RSTR1;
            resetbit = RCC_APB1RSTR1_TIM4RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM5_PWM
          case 5:
            regaddr  = STM32_RCC_APB1RSTR1;
            resetbit = RCC_APB1RSTR1_TIM5RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM8_PWM
          case 8:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM8RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM16_PWM
          case 16:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM16RST;
            break;
#endif
#ifdef CONFIG_STM32_TIM17_PWM
          case 17:
            regaddr  = STM32_RCC_APB2RSTR;
            resetbit = RCC_APB2RSTR_TIM17RST;
            break;
#endif
          default:
            return -EINVAL;
        }
    }
  else
    {
      switch (priv->timid)
        {
#ifdef CONFIG_STM32_LPTIM1_PWM
          case 1:
            regaddr  = STM32_RCC_APB1RSTR1;
            resetbit = RCC_APB1RSTR1_LPTIM1RST;
            break;
#endif
#ifdef CONFIG_STM32_LPTIM2_PWM
          case 2:
            regaddr  = STM32_RCC_APB1RSTR2;
            resetbit = RCC_APB1RSTR2_LPTIM2RST;
            break;
#endif
          default:
            return -EINVAL;
        }
    }

  /* Disable interrupts momentary to stop any ongoing timer processing and
   * to prevent any concurrent access to the reset register.
   */

  flags = enter_critical_section();

  /* Stopped so frequency is zero */

  priv->frequency = 0;

  /* Disable further interrupts and stop the timer */

  pwm_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  pwm_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  /* Reset the timer - stopping the output and putting the timer back
   * into a state where pwm_start() can be called.
   */

  regval  = getreg32(regaddr);
  regval |= resetbit;
  putreg32(regval, regaddr);

  regval &= ~resetbit;
  putreg32(regval, regaddr);
  leave_critical_section(flags);

  pwminfo("regaddr: %08" PRIx32 " resetbit: %08" PRIx32 "\n",
          regaddr, resetbit);
  pwm_dumpregs(dev, "After stop");
  return OK;
}

/****************************************************************************
 * Name: pwm_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                     unsigned long arg)
{
#ifdef CONFIG_DEBUG_PWM_INFO
  struct stm32_pwmtimer_s *priv = (struct stm32_pwmtimer_s *)dev;

  /* There are no platform-specific ioctl commands */

  pwminfo("TIM%u\n", priv->timid);
#endif
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_pwminitialize
 *
 * Description:
 *   Initialize one timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.  The number of valid timer
 *     IDs varies with the STM32 MCU and MCU family but is somewhere in
 *     the range of {1,..,17}.
 *
 * Returned Value:
 *   On success, a pointer to the STM32 lower half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 ****************************************************************************/

struct pwm_lowerhalf_s *stm32_pwminitialize(int timer)
{
  struct stm32_pwmtimer_s *lower;

  pwminfo("TIM%u\n", timer);

  switch (timer)
    {
#ifdef CONFIG_STM32_TIM1_PWM
      case 1:
        lower = &g_pwm1dev;

        /* Attach but disable the TIM1 update interrupt */

        break;
#endif

#ifdef CONFIG_STM32_TIM2_PWM
      case 2:
        lower = &g_pwm2dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM3_PWM
      case 3:
        lower = &g_pwm3dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM4_PWM
      case 4:
        lower = &g_pwm4dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM5_PWM
      case 5:
        lower = &g_pwm5dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM8_PWM
      case 8:
        lower = &g_pwm8dev;

        /* Attach but disable the TIM8 update interrupt */

        break;
#endif

#ifdef CONFIG_STM32_TIM15_PWM
      case 15:
        lower = &g_pwm15dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM16_PWM
      case 16:
        lower = &g_pwm16dev;
        break;
#endif

#ifdef CONFIG_STM32_TIM17_PWM
      case 17:
        lower = &g_pwm17dev;
        break;
#endif

      default:
        pwmerr("ERROR: No such timer configured\n");
        return NULL;
    }

  return (struct pwm_lowerhalf_s *)lower;
}

/****************************************************************************
 * Name: stm32_lp_pwminitialize
 *
 * Description:
 *   Initialize one low-power timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.  The number of valid timer
 *     IDs varies with the STM32 MCU and MCU family but is somewhere in
 *     the range of {1,..,2}.
 *
 * Returned Value:
 *   On success, a pointer to the STM32 lower half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 ****************************************************************************/

#ifdef HAVE_LPTIM
struct pwm_lowerhalf_s *stm32_lp_pwminitialize(int timer)
{
  struct stm32_pwmtimer_s *lower;

  pwminfo("LPTIM%u\n", timer);

  switch (timer)
    {
#ifdef CONFIG_STM32_LPTIM1_PWM
      case 1:
        lower = &g_pwmlp1dev;
        break;
#endif

#ifdef CONFIG_STM32_LPTIM2_PWM
      case 2:
        lower = &g_pwmlp2dev;
        break;
#endif

      default:
        pwmerr("ERROR: No such timer configured\n");
        return NULL;
    }

  return (struct pwm_lowerhalf_s *)lower;
}
#endif /* HAVE_LPTIM */

#endif /* CONFIG_STM32_TIMn_PWM, n = 1,...,17 */
